## SQL Query Practise

creating engine to query on

In [25]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///etf_data.db', echo=False)  # use echo=True for debugging SQL statements

## QUERY EXAMPLES

LISTING ALL TABLES IN DATABASE (ETFS)

In [30]:
# List all tables in the database
tables_query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = pd.read_sql(tables_query, engine)
print(tables)

  name
0  GLD
1  SPY
2  QQQ
3  TLT
4  IWM
5  GDX
6  SLV
7  SMH
8  USO

BASIC DATA RETRIEVAL

In [31]:
query = """
SELECT *
FROM GDX
LIMIT 5;
"""
preview_data = pd.read_sql(query, engine)
display(preview_data.head(3))

,Date,Open,High,Low,Close,Adj Close,Volume
0,2006-05-22 00:00:00.000000,31.583517,32.249435,31.021378,32.197544,32.197544,197100
1,2006-05-23 00:00:00.000000,32.647256,33.918554,32.647256,32.828869,32.828869,620900
2,2006-05-24 00:00:00.000000,32.111068,32.491592,31.021383,31.583523,31.583523,638600

LAST 5 CLOSING PRICES FROM GLD

- DESC means descending

In [32]:
query = """
SELECT Date, Close
FROM GLD
ORDER BY Date DESC
LIMIT 5;
"""
preview_data = pd.read_sql(query, engine)
display(preview_data.head(6))

                         Date       Close
0  2024-08-15 00:00:00.000000  227.149994
1  2024-08-14 00:00:00.000000  226.199997
2  2024-08-13 00:00:00.000000  228.059998
3  2024-08-12 00:00:00.000000  228.410004
4  2024-08-09 00:00:00.000000  224.559998

AVG VOLUME FOR EACH MONTH OF SPY

In [36]:
query = """
SELECT 
    strftime('%Y-%m', Date) AS Month,
    AVG(Volume) AS Avg_Volume
FROM SPY
GROUP BY Month
ORDER BY Month DESC;
"""
preview_data = pd.read_sql(query, engine)
display(preview_data.head(12))

      Month    Avg_Volume
0   2024-08  6.790146e+07
1   2024-07  4.720298e+07
2   2024-06  4.678543e+07
3   2024-05  5.242111e+07
4   2024-04  7.240791e+07
5   2024-03  7.366234e+07
6   2024-02  6.967327e+07
7   2024-01  8.098242e+07
8   2023-12  8.215540e+07
9   2023-11  7.142670e+07
10  2023-10  9.087044e+07
11  2023-09  7.943366e+07

FIND DAYS WHERE PRICE CLOSED 5% HIGHER OR 5% LOWER

In [50]:
query = """
SELECT Date, Open, Close,
    ((Close - Open) / Open * 100) AS Price_Increase_Percentage
FROM GLD
WHERE ((Close - Open) / Open * 100) > 5
   OR ((Close - Open) / Open * 100) < -5
ORDER BY Price_Increase_Percentage DESC;
"""
preview_data = pd.read_sql(query, engine)
display(preview_data.head(5))

,Date,Open,Close,Price_Increase_Percentage
0,2008-09-17 00:00:00.000000,77.110001,85.459999,10.828684
1,2013-09-18 00:00:00.000000,125.320000,132.009995,5.338330
2,2012-02-29 00:00:00.000000,173.190002,164.289993,-5.138870
3,2008-10-10 00:00:00.000000,89.589996,83.220001,-7.110163